// Description:

// Предположим, что целая матрица - это пруд с водой.

// В любое место пруда (в любую позицию матрицы) бросают камушек.
// Место попадания обозначим цифрой 0. От камушка (от 0) по воде расходятся круги в виде цифр 1, 2,3, . . . .

// Написать программу для формирования поверхности пруда после попадания камушка в любую точку пруда.

// Пример: матрица (5×5), камушек попал в позицию (2, 3).
// В результате поверхность пруда должна быть представлена следующим образом:

// 2 2 2 2 3
// 1 1 1 2 3
// 1 0 1 2 3
// 1 1 1 2 3
// 2 2 2 2 3


// Solution:

function pond(w, h, x, y) {

  

}

// Sample Tests:

pond(5, 5, 2, 3) // "Normal"
